*>****************************************************************
*> Author: Timothy Waters
*> Date: July 21, 2018
*> Troy University
*> CS 3320: Business Systems Programming
*> Purpose: This program validates the entry of a VIN.
*>****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. WatersTA8.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 WS-WORK-AREAS.
    05 MORE-RECORDS              PIC X(1).
01 VIN-WS   PIC X(30).
01 OUT-VIN  PIC X(50).
01 VIN-LEN  PIC 9(2).
01 OUT-VIN-LEN PIC Z(2).
01 VIN-LEN-MSG  PIC X(40).

01 FIRST-CHAR-TABLE.
    05 FIRST-CHAR-SET OCCURS 8 TIMES.
        10 FIRST-CHAR PIC X(1).
01 FIRST-OUTPUT PIC X(60).

01 COUNTER PIC 9(1) VALUE 1.
01 COUNT-CHAR PIC 9(1) VALUE 0.

01 TENTH-CHAR-TABLE.
    05 TENTH-CAR-SET OCCURS 5 TIMES.
        10 TENTH-CHAR PIC X(1).
01 TENTH-OUTPUT  PIC X(60).

01 LAST-SIX-CHAR PIC X(6).
01 LAST-SIX-OUTPUT PIC X(60).

01 VIN-ERROR  PIC 9(1).
01 VIN-ERROR-MSG  PIC X(30).

SCREEN SECTION.

01 CLEAR-SCREEN.
    05 BLANK SCREEN BACKGROUND-COLOR 1 FOREGROUND-COLOR 7.

01 INPUT-SCREEN AUTO.
    05 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7.
    05 LINE 6 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 VALUE 'ENTER YOUR VIN: '.
    05 INPUT-VIN REVERSE-VIDEO PIC X(20) USING VIN-WS.

01 OUTPUT-SCREEN AUTO.
    05 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7.
    05 LINE 8 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 VALUE 'YOU ENTERED: '.
    05 OUT-DATA LINE 8 COLUMN 15 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 PIC X(50) FROM OUT-VIN.
    *> 05 LINE 9 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 VALUE 'VIN LENGTH: '.
    *> 05 OUT-LEN LINE 9 COLUMN 15 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 PIC X(3) FROM OUT-VIN-LEN.
    *> 05 LINE 10 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 VALUE 'VIN LEN MSG: '.
    05 VIN-STATUS-MSG LINE 9 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 PIC X(40) FROM VIN-ERROR-MSG.
    05 VIN-MSG LINE 10 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 PIC X(40) FROM VIN-LEN-MSG.
    *> 05 LINE 11 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 VALUE 'FIRST CHAR ACCEPTED: '.
    05 FIRST-OUT LINE 11 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 PIC X(60) FROM FIRST-OUTPUT.
    *> 05 LINE 12 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 VALUE 'TENTH CHAR ACCEPTED: '.
    05 TENTH-OUT LINE 12 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 PIC X(60) FROM TENTH-OUTPUT.
    *> 05 LINE 13 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 VALUE 'LAST SIX ACCEPTED: '.
    05 LAST-OUT LINE 13 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 PIC X(60) FROM LAST-SIX-OUTPUT.
    *> 05 LINE 14 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 VALUE 'LAST SIX CHARS: '.
    *> 05 LAST-SIX LINE 14 COLUMN 23 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 PIC X(6) FROM LAST-SIX-CHAR.


01 OUTPUT-MORE AUTO.
    05 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7.
    05 LINE 20 COLUMN 2 HIGHLIGHT BACKGROUND-COLOR 1 FOREGROUND-COLOR 7 VALUE 'VALIDATE ANOTHER VIN? (Y/N): '.
    05 INPUT-MORE REVERSE-VIDEO PIC X(2) USING MORE-RECORDS.


PROCEDURE DIVISION.
100-MAIN-PROCEDURE.
    PERFORM UNTIL MORE-RECORDS = "N" OR "n"
        MOVE 0 TO VIN-ERROR
        DISPLAY CLEAR-SCREEN
        MOVE SPACES TO VIN-WS
        MOVE SPACES TO MORE-RECORDS
        DISPLAY INPUT-SCREEN
        ACCEPT INPUT-SCREEN
        PERFORM 200-VIN-LENGTH
        MOVE VIN-WS TO OUT-VIN
        PERFORM 300-CHECK-FIRST
        PERFORM 400-CHECK-TENTH
        PERFORM 500-CHECK-LAST-SIX
        PERFORM 600-ERROR-CHECK
        DISPLAY OUTPUT-SCREEN
        DISPLAY OUTPUT-MORE
        ACCEPT OUTPUT-MORE
    END-PERFORM
    STOP RUN.

200-VIN-LENGTH.
    MOVE ZEROS TO VIN-LEN.
    INSPECT FUNCTION REVERSE(VIN-WS) TALLYING VIN-LEN FOR LEADING SPACES.
    COMPUTE VIN-LEN = LENGTH OF VIN-WS - VIN-LEN.
    MOVE VIN-LEN TO OUT-VIN-LEN.

    IF VIN-LEN = 17
        MOVE SPACES TO VIN-LEN-MSG
    ELSE
        MOVE "VIN MUST BE 17 CHARACTERS." TO VIN-LEN-MSG
        ADD 1 TO VIN-ERROR
    END-IF.

300-CHECK-FIRST.
    MOVE 0 TO COUNT-CHAR
    MOVE 1 TO COUNTER
    MOVE "1" TO FIRST-CHAR(1).
    MOVE "5" TO FIRST-CHAR(2).
    MOVE "7" TO FIRST-CHAR(3).
    MOVE "F" TO FIRST-CHAR(4).
    MOVE "J" TO FIRST-CHAR(5).
    MOVE "T" TO FIRST-CHAR(6).
    MOVE "X" TO FIRST-CHAR(7).
    MOVE "Z" TO FIRST-CHAR(8).

    PERFORM UNTIL COUNTER > 8

        IF VIN-WS(1:1) = FIRST-CHAR(COUNTER)
           MOVE 1 TO COUNT-CHAR
        END-IF
        ADD 1 TO COUNTER
    END-PERFORM.
    IF COUNT-CHAR = 1
        MOVE SPACES TO FIRST-OUTPUT
    ELSE
        MOVE "FIRST CHARACTER: Must be either 1, 5, 7, F, J, T, X, or Z." TO FIRST-OUTPUT
        ADD 1 TO VIN-ERROR
    END-IF.

400-CHECK-TENTH.
    MOVE 0 TO COUNT-CHAR.
    MOVE 1 TO COUNTER.
    MOVE "K" TO TENTH-CHAR(1).
    MOVE "M" TO TENTH-CHAR(2).
    MOVE "R" TO TENTH-CHAR(3).
    MOVE "V" TO TENTH-CHAR(4).
    MOVE "Z" TO TENTH-CHAR(5).

    PERFORM UNTIL COUNTER > 5
        IF VIN-WS(10:1) = TENTH-CHAR(COUNTER)
            MOVE 1 TO COUNT-CHAR
        END-IF
        ADD 1 TO COUNTER
    END-PERFORM.
    IF COUNT-CHAR = 1
        MOVE "TENTH CHARACTER: MUST NOT BE K, M, R, V, or Z." TO TENTH-OUTPUT
        ADD 1 TO VIN-ERROR
    ELSE
        MOVE SPACES TO TENTH-OUTPUT
    END-IF.

500-CHECK-LAST-SIX.
    MOVE VIN-WS(12:6) TO LAST-SIX-CHAR.
    IF FUNCTION TEST-NUMVAL(LAST-SIX-CHAR) EQUAL ZERO THEN
        MOVE SPACES TO LAST-SIX-OUTPUT
    ELSE
        MOVE "LAST SIX CHARACTERS: MUST BE NUMBERS" TO LAST-SIX-OUTPUT
        ADD 1 TO VIN-ERROR
    END-IF.

600-ERROR-CHECK.
    IF VIN-ERROR = 0
            MOVE "VIN IS VALID! YAY!" TO VIN-ERROR-MSG
        ELSE
            MOVE "VIN IS NOT VALID. :-( " TO VIN-ERROR-MSG
    END-IF.

END PROGRAM WatersTA8.
