*>****************************************************************
*> Author: Timothy Waters
*> Date: June 30, 2018
*> Troy University
*> CS 3320: Business Systems Programming
*> Purpose: This program calculates the fuel efficiency for a
*> fleet of taxis.
*>****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. WatersTA5.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT REC-OUT
        ASSIGN TO "WatersTA5.rpt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.

FILE SECTION.
FD REC-OUT
    RECORD CONTAINS 80 CHARACTERS.
01 PRINT-REC  PIC X(80).


WORKING-STORAGE SECTION.
01 WS-WORK-AREAS.
    05 MORE-RECORDS              PIC X(1) VALUE "Y".
01 WS-CURRENT-DATE-DATA.
    05  WS-CURRENT-DATE.
        10  WS-CURRENT-YEAR         PIC 9(04).
        10  WS-CURRENT-MONTH        PIC 9(02).
        10  WS-CURRENT-DAY          PIC 9(02).
    05  WS-CURRENT-TIME.
        10  WS-CURRENT-HOURS        PIC 9(02).
        10  WS-CURRENT-MINUTE       PIC 9(02).
        10  WS-CURRENT-SECOND       PIC 9(02).
        10  WS-CURRENT-MILLISECONDS PIC 9(02).


01 OUTPUT-HEADER.
    05 V-ID-HEAD  PIC X(10) VALUE "VEHICLE ID".
    05 PIC X(2) VALUE SPACES.
    05 V-DESC-HEAD  PIC X(12) VALUE "VEHICLE DESC".
    05 PIC X(2) VALUE SPACES.
    05 TRAV-MILES-HEAD  PIC X(12) VALUE "TRAVEL MILES".
    05 PIC X(2) VALUE SPACES.
    05 GALLONS-HEAD PIC X(12) VALUE "# OF GALLONS".
    05 PIC X(2) VALUE SPACES.
    05 MPG-HEAD  PIC X(3) VALUE "MPG".

01 COMPANY-HEAD.
    05 PIC X(16) VALUE SPACES.
    05 COMPANY  PIC X(20) VALUE "URNext Taxi Company".
    05 SHOW-DATE.
        10  PIC X(10) VALUE SPACES.
        10  CURRENT-MONTH        PIC 9(02).
        10  PIC X VALUE "/".
        10  CURRENT-DAY          PIC 9(02).
        10  PIC X VALUE "/".
        10  CURRENT-YEAR         PIC 9(04).
01 OUTPUT-RECORD.
    05 VEHICLE-ID  PIC X(10).
    05 VEHICLE-DESC  PIC X(10).
    05 MILES-TRAVELED  PIC 9(4).
    05 GALLONS-USED  PIC 99V99.
    05 MPG-OUT  PIC 9(4).99.

01 OUTPUT-RECORD-DISPLAY.
    05 VEHICLE-ID-DISPLAY  PIC X(10).
    05 PIC X(2) VALUE SPACES.
    05 VEHICLE-DESC-DISPLAY  PIC X(10).
    05 PIC X(3) VALUE SPACES.
    05 MILES-TRAVELED-DISPLAY  PIC Z(4).
    05 PIC X(11) VALUE SPACES.
    05 GALLONS-USED-DISPLAY  PIC ZZ.99.
    05 PIC X(7) VALUE SPACES.
    05 MPG-OUT-DISPLAY  PIC Z(4).99.

01 FLEET-MILES  PIC 9(8) VALUE 0.
01 FLEET-GALLONS  PIC 9(6)V99 VALUE 0.
01 FLEET.
    05 FLEET-COUNT  PIC 99 VALUE 0.
    05 FLEET-MPG  PIC 9(4).99.
01 FLEET-DISPLAY.
    05 PIC X(11) VALUE SPACES.
    05 FLEET-COUNT-DISPLAY  PIC ZZ VALUE 0.
    05 PIC X(11) VALUE SPACES.
    05 FLEET-MPG-DISPLAY  PIC Z(4).99.
01 FLEET-HEAD.
    05 PIC X(12) VALUE SPACES.
    05 FLEET-SIZE-HEAD PIC X(10) VALUE "Fleet Size".
    05 PIC X(4) VALUE SPACES.
    05 FLEET-MPG-HEAD  PIC X(10) VALUE "Fleet MPG".

PROCEDURE DIVISION.
100-MAIN-PROCEDURE.
    OPEN OUTPUT REC-OUT.
    MOVE FUNCTION CURRENT-DATE to WS-CURRENT-DATE-DATA
             DISPLAY WS-CURRENT-DATE-DATA.

    MOVE WS-CURRENT-MONTH TO CURRENT-MONTH
    MOVE WS-CURRENT-DAY TO CURRENT-DAY
    MOVE WS-CURRENT-YEAR TO CURRENT-YEAR
    WRITE PRINT-REC FROM COMPANY-HEAD
    WRITE PRINT-REC FROM OUTPUT-HEADER
    PERFORM UNTIL MORE-RECORDS = "N"
        *>DISPLAY "Hello world"
        DISPLAY "ENTER VEHICLE ID:"
        ACCEPT VEHICLE-ID
        MOVE VEHICLE-ID TO VEHICLE-ID-DISPLAY
        DISPLAY "ENTER VEHICLE DESCRIPTION:"
        ACCEPT VEHICLE-DESC
        MOVE VEHICLE-DESC TO VEHICLE-DESC-DISPLAY
        DISPLAY "ENTER MILES TRAVELED:"
        ACCEPT MILES-TRAVELED
        MOVE MILES-TRAVELED TO MILES-TRAVELED-DISPLAY
        DISPLAY "ENTER GALLONS OF GAS USED:"
        ACCEPT GALLONS-USED
        MOVE GALLONS-USED TO GALLONS-USED-DISPLAY
        DIVIDE MILES-TRAVELED BY GALLONS-USED GIVING MPG-OUT
        MOVE MPG-OUT TO MPG-OUT-DISPLAY
        WRITE PRINT-REC FROM OUTPUT-RECORD-DISPLAY
            AFTER ADVANCING 1 LINE
        ADD 1 TO FLEET-COUNT
        ADD MILES-TRAVELED TO FLEET-MILES
        ADD GALLONS-USED TO FLEET-GALLONS
        DISPLAY "IS THERE MORE DATA? (Y/N)"
        ACCEPT MORE-RECORDS
    END-PERFORM

    DIVIDE FLEET-MILES BY FLEET-GALLONS GIVING FLEET-MPG
    MOVE FLEET-COUNT TO FLEET-COUNT-DISPLAY
    MOVE FLEET-MPG TO FLEET-MPG-DISPLAY
    WRITE PRINT-REC FROM FLEET-HEAD
        AFTER ADVANCING 4 LINES
    WRITE PRINT-REC FROM FLEET-DISPLAY
        AFTER ADVANCING 1 LINE
    CLOSE REC-OUT.

    STOP RUN.
END PROGRAM WatersTA5.
